routes_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1  [["id", 1]]
---
    def show
        render json: Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def update
        artwork = Artwork.find_by(id: params[:id])

DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 6]]
---
    def destroy
        render json: Artwork.destroy(params[:id])