routes_controllers/app/controllers/artwork_shares_controller.rb

INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 3], ["viewer_id", 2]]
---
    def create
        artwork_shares = ArtworkShare.new(params.require(:artwork_share).permit(:artwork_id, :viewer_id))
        # replace the `user_attributes_here` with the actual attribute keys
        if artwork_shares.save

DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 3]]
---
    def destroy
        render json: ArtworkShare.destroy(params[:id])