routes_controllers/app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1  [["artwork_id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = $1  [["user_id", 3]]
---
    def index
        if params[:artwork_id]
            comments = Comment.where(artwork_id: params[:artwork_id])
            render json: comments
        elsif params[:user_id]
            comments = Comment.where(user_id: params[:user_id])