routes_controllers/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Jay"], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        debugger
        if params[:query]
            users = User.find_by(username: params[:query])
        else
            users = Users.all

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
    def show
        render json: User.find(params[:id])

INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "cC"], ["email", "ccc@cc.c"]]
---
    def create
        user = User.new(params.require(:user).permit(:username))
        # replace the `user_attributes_here` with the actual attribute keys
        if user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "changed_name"], ["email", "changed_email"], ["id", 2]]
---
    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 11]]
---
    def destroy
        render json: User.destroy(params[:id])